module PostsHelper
  def kind
    kind = ["自由記述", "一問一答", "一問多答", "並び替え"]
    kind.map { |s| [s, s] }.to_h
  end

  def media
    media = ["漫画", "アニメ", "映画", "小説", "ゲーム"]
    media.map { |s| [s, s] }.to_h
  end

  def series
    series = ["東の海編", "アラバスタ編", "空島編", "ウォーターセブン編", "エニエス・ロビー編", "スリラーバーク編",
              "シャボンディ諸島編", "女ヶ島編", "インペルダウン編", "頂上戦争編", "魚人島編", "パンクハザード編",
              "ドレスローザ編", "ゾウ編", "ホールケーキアイランド編", "世界会議編", "ワノ国編"]
    series.map { |s| [s, s] }.to_h
  end

  def belong
    belong = ["麦わらの一味", "海軍", "世界政府", "四皇", "王下七武海", "革命軍", "最悪の世代", "麦わら大船団"]
    belong.map { |s| [s, s] }.to_h
  end

  def group
    group = ["アーロン一味", "赤髪海賊団", "赤鞘九人男", "イデオ海賊団", "犬嵐銃士隊", "ウソップ海賊団",
             "美しき海賊団", "オロチお庭番衆", "オンエア海賊団", "侠客団", "海軍本部", "神の軍団", "カリブー海賊団",
             "ガレーラカンパニー", "キッド海賊団", "狂死郎一家", "巨兵海賊団", "金獅子海賊団", "九蛇海賊団",
             "クリーク海賊団", "黒炭家", "クロネコ海賊団", "黒ひげ海賊団", "光月家", "五老星",
             "猿山連合軍", "CP-0", "CP9", "ジェルマ66", "霜月家", "シャンディア", "賞金稼ぎ", "白ひげ海賊団",
             "白ひげ海賊団傘下", "新巨兵海賊団", "新魚人海賊団", "人生バラ色ライダーズ", "砂砂団",
             "スペード海賊団", "スリラーバーク海賊団", "スワロー島", "世界経済新聞社",
             "タイヨウの海賊団", "チューリップ海賊団", "天竜人", "トムズワーカーズ", "ドレーク海賊団", "ドレスローザ王国",
             "ドンキホーテ一族",
             "ドンキホーテファミリー", "トンタッタ王国", "ニセ麦わらの一味", "ネフェルタリ家", "ノックス海賊団",
             "ハートの海賊団",
             "破戒僧海賊団", "八宝水軍", "バギーズデリバリー", "バルトクラブ", "バレルズ海賊団", "バロックワークス", "反乱軍",
             "百獣海賊団", "ビッグ・マム海賊団", "羊の家", "人攫い屋", "ファイアタンク海賊団", "フォクシー海賊団",
             "フランキー一家", "ブリキング海賊団", "ブルージャム海賊団", "ベラミー海賊団",
             "ホーキンス海賊団", "ボニー海賊団", "マクロ一味", "見廻り組", "ヨンタマリア大船団", "リク家", "ルンバー海賊団",
             "ローリング海賊団", "ロジャー海賊団", "ロックス海賊団"]
    group.map { |s| [s, s] }.to_h
  end

  def geography
    geography = ["アーロンパーク", "アッパーヤード", "アマゾン・リリー", "アラバスタ王国", "イリシア王国", "インペルダウン",
                 "ウイスキーピーク", "ヴィラ", "ウェザリア", "ウォーターセブン", "兎丼", "海の森",
                 "エニエス・ロビー", "エルバフ", "オイコット王国", "鬼ヶ島", "オハラ",
                 "オモチャの家", "オレンジの町", "カカオ島", "花ノ国", "カマバッカ王国", "希美", "魚人街",
                 "クライガナ島", "九里", "不確かな物の終着駅", "ゴア王国", "ゴート島", "ココヤシ村",
                 "ゴサの町", "ゴッドバレー", "コリーダコロシアム", "コルボ山", "サクラ王国", "サン・ファルド",
                 "シェルズタウン", "ジェルマ王国", "シフト駅", "シモツキ村", "ジャヤ", "シャボンディ諸島",
                 "シロップ村", "スカイピア", "スパイダーマイルズ", "スフィンクス", "スリラーバーク",
                 "聖地マリージョア", "セント・ポプラ", "ソルベ王国", "珍獣の島", "月", "テーナ・ゲーナ王国",
                 "テキーラウルフ", "万国", "トリノ王国", "ドレスローザ", "トンタッタ王国", "何もない島",
                 "ニューマリンフォード", "白舞", "ハチノス", "バテリラ", "花の都", "バナロ島", "バラティエ",
                 "ハラヘッターニャ", "バルジモア", "バルティゴ", "パンクハザード",
                 "フーシャ村", "フールシャウト島", "双子岬", "プッチ", "フレバンス", "プロデンス王国",
                 "ボーイン列島", "ホールケーキアイランド", "マリンフォード",
                 "ミラーボール島", "メルヴィユ", "モガロ王国", "モコモ公国",
                 "モックタウン", "ラフテル", "リヴァース・マウンテン", "リトルガーデン", "リュウグウ王国", "鈴後",
                 "ルスカイナ", "ルブニール王国", "ルルシア王国", "赤い港", "ローグタウン",
                 "水先星島", "ロングリングロングランド", "ワノ国", "悪ブラックドラム王国"]
    geography.map { |s| [s, s] }.to_h
  end

  def category
    category = ["悪魔の実", "通り名", "覇気", "性別", "船", "誕生日", "年齢", "身長", "星座", "血液型", "懸賞金",
                "声優", "セリフ", "技", "武器", "刀", "笑い方", "道具", "貝", "キャラクター", "地理", "店"]
  end
end
